# JSON to CSV the right way

In [33]:
import pandas as pd

In [34]:
#____________________________________________________________________ SIMPLE JSON AND LIST
simple_json = {
    'name': 'David',
    'city': 'London',
    'income': 80000,
}

simple_json_2 = {
    'name': 'Taylor',
    'city': 'Chicago',
    'income': 120000,
}

simple_json_list = [
    simple_json, 
    simple_json_2

]

#____________________________________________________________________ TWO-LEVEL JSON AND LIST
two_level_json = {
    'name': 'David',
    'city': 'London',
    'income': 80000,
    'skills': {
        'python': 'advanced',
        'SQL': 'advanced',
        'GCP': 'mid'
    },
    'roles': {
        "project manager":False,
        "data engineer":False,
        "data scientist":True,
        "data analyst":False
        }
    }

two_level_json_2 = {
    'name': 'Taylor',
    'city': 'Chicago',
    'income': 120000,
    'skills': {
        'python': 'mid',
        'SQL': 'advanced',
        'GCP': 'beginner'
    },
    'roles': {
        "project manager":False,
        "data engineer":False,
        "data scientist":False,
        "data analyst":True
        }
    }


two_level_json_list = [
    two_level_json, 
    two_level_json_2

]

#____________________________________________________________________ MULTIPLE LEVELS JSON AND LIST

multiple_levels_json = {
    'name': 'David',
    'city': 'London',
    'income': 80000,
    'skills': {
        'python': 'advanced',
        'SQL': 'advanced',
        'GCP': 'mid'
    },
    'roles': {
        "project manager":False,
        "data engineer":False,
        "data scientist":True,
        "data analyst":False,
        },
    'working experience':{
        'HP':{
            'data analyst': 16,
            'data scientist': 10
        },
        'Deloitte':{
            'intern':12,
            'junior data analyst': 6
        }
    }
}


multiple_levels_json_2 = {
    'name': 'Taylor',
    'city': 'Chicago',
    'income': 120000,
    'skills': {
        'python': 'mid',
        'SQL': 'advanced',
        'GCP': 'beginner'
    },
    'roles': {
        "project manager":False,
        "data engineer":False,
        "data scientist":False,
        "data analyst":True
        },
    'working experience':{
        'Samsung':{
            'data analyst': 9,
        },
        'Google':{
            'intern':5,
            'junior data analyst': 20
        }
    }
}

nested_level_json_list = [
    multiple_levels_json, 
    multiple_levels_json_2

]

## Converting a simple JSON
### A single dictionary

In [35]:
pd.json_normalize(simple_json)

    name    city  income
0  David  London   80000

### A list of dictionaries

In [36]:
pd.json_normalize(simple_json_list)

     name     city  income
0   David   London   80000
1  Taylor  Chicago  120000

## Converting a JSON with two levels
### A single dictionary

In [37]:
pd.json_normalize(two_level_json)

,name,city,income,skills.python,skills.SQL,skills.GCP,roles.project manager,roles.data engineer,roles.data scientist,roles.data analyst
0,David,London,80000,advanced,advanced,mid,False,False,True,False

In [38]:
# We can use the max_level argument to define our maximum level
pd.json_normalize(two_level_json, max_level=2)

,name,city,income,skills.python,skills.SQL,skills.GCP,roles.project manager,roles.data engineer,roles.data scientist,roles.data analyst
0,David,London,80000,advanced,advanced,mid,False,False,True,False

### A list of dictionaries

In [39]:
pd.json_normalize(two_level_json_list_level_json_list)

NameError: name 'two_level_json_list_level_json_list' is not defined

## Converting a JSON with multiple levels
### A single dictionary

In [ ]:
pd.json_normalize(multiple_levels_json, max_level=2)

,name,city,income,skills.python,skills.SQL,skills.GCP,roles.project manager,roles.data engineer,roles.data scientist,roles.data analyst,working experience.HP.data analyst,working experience.HP.data scientist,working experience.Deloitte.intern,working experience.Deloitte.junior data analyst
0,David,London,80000,advanced,advanced,mid,False,False,True,False,16,10,12,6

In [ ]:
pd.json_normalize(multiple_levels_json)

,name,city,income,skills.python,skills.SQL,skills.GCP,roles.project manager,roles.data engineer,roles.data scientist,roles.data analyst,working experience.HP.data analyst,working experience.HP.data scientist,working experience.Deloitte.intern,working experience.Deloitte.junior data analyst
0,David,London,80000,advanced,advanced,mid,False,False,True,False,16,10,12,6

### A list of dictionaries

In [ ]:
pd.json_normalize(multiple_level_json_list)

,name,city,income,skills.python,skills.SQL,skills.GCP,roles.project manager,roles.data engineer,roles.data scientist,roles.data analyst
0,David,London,80000,advanced,advanced,mid,False,False,True,False
1,Taylor,Chicago,120000,mid,advanced,beginner,False,False,False,True

In [ ]:
#____________________________________________________________________ MULTIPLE LEVELS JSON AND LIST

multiple_levels_json = {
    'name': 'David',
    'city': 'London',
    'income': 80000,
    'skills': {
        'python': 'advanced',
        'SQL': 'advanced',
        'GCP': 'mid'
    },
    'roles': {
        "project manager":False,
        "data engineer":False,
        "data scientist":True,
        "data analyst":False,
        },
    'working experience':{
        'HP':{
            'data analyst': 16,
            'data scientist': 10
        },
        'Deloitte':{
            'intern':12,
            'junior data analyst': 6
        }
    }
}


multiple_levels_json_2 = {
    'name': 'Taylor',
    'city': 'Chicago',
    'income': 120000,
    'skills': {
        'python': 'mid',
        'SQL': 'advanced',
        'GCP': 'beginner'
    },
    'roles': {
        "project manager":False,
        "data engineer":False,
        "data scientist":False,
        "data analyst":True
        }
}

nested_level_json_list = [
    multiple_levels_json, 
    multiple_levels_json_2

]